eval/results/20260329_100123/gpu_only_bench.log
DEBUG_AG: Process 11872 importing vllm.config
DEBUG_AG: Process 11872 importing vllm.distributed
DEBUG_AG: Process 11872 importing vllm.distributed.communication_op
DEBUG_AG: Process 11872 importing vllm.distributed.parallel_state
DEBUG_AG: Process 11872 importing vllm.distributed.utils
DEBUG_AG: Process 11872 finished importing vllm.distributed.utils
DEBUG_AG: Process 11872 finished importing vllm.distributed.parallel_state
DEBUG_AG: Process 11872 importing vllm.platforms
DEBUG_AG: Process 11872 vllm.platforms import step 1 (torch)
DEBUG_AG: Process 11872 checking plugin heterogeneous
DEBUG_AG: Process 11872 checking plugin tpu
DEBUG_AG: Process 11872 checking plugin cuda
DEBUG_AG: Process 11872 finished nvmlShutdown in cuda_platform_plugin
DEBUG_AG: Process 11872 selected platform vllm.platforms.cuda.CudaPlatform
DEBUG_AG: Process 11872 importing vllm.platforms.cuda
DEBUG_AG: Process 11872 finished importing vllm.platforms.cuda
DEBUG_AG: Process 11872 finished importing vllm.distributed
DEBUG_AG: Process 11872 finished importing vllm.config
/workspace/vllm_hybrid/benchmarks/benchmark_serving.py:1298: DeprecationWarning: benchmark_serving.py is deprecated and will be removed in a future version. Please use 'vllm bench serve' instead.
  main(args)
Namespace(backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=None, model='Qwen/Qwen2.5-7B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=500, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/workspace/vllm_hybrid/eval/results/20260329_100123/gpu_only.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:53<00:00,  9.30it/s] 
============ Serving Benchmark Result ============
Successful requests:                     500       
Benchmark duration (s):                  53.76     
Total input tokens:                      255169    
Total generated tokens:                  244397    
Request throughput (req/s):              9.30      
Output token throughput (tok/s):         4545.94   
Total Token throughput (tok/s):          9292.24   
---------------Time to First Token----------------
Mean TTFT (ms):                          18369.64  
Median TTFT (ms):                        11011.20  
P99 TTFT (ms):                           38339.47  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          48.11     
Median TPOT (ms):                        51.11     
P99 TPOT (ms):                           92.81     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.03     
Median ITL (ms):                         31.24     
P99 ITL (ms):                            194.27    
==================================================